dict=[
['王*龙', '北京市海淀区苏州街大恒科技大厦南座4层'],
['庞*飞', '北京市昌平区汇德商厦四楼403'],
['顾*锐', '江苏省扬州市三垛镇工业集中区扬州市立华畜禽有限公司'],
['王*飞', '上海市徐汇区上海市徐汇区H88越虹广场B座5E'],
['华*升', '北京市海淀区杰睿大厦'],
['唐*宁', '新疆乌鲁木齐市新疆省乌鲁木齐头屯河区火车西站6街']
]
pro_json=['江苏', '上海', '新疆乌鲁木齐市新疆', '北京']
province=['北京市海淀区苏州街大恒科技大厦南座4层', '北京市昌平区汇德商厦四楼403', '江苏省扬州市三垛镇工业集中区扬州市立华畜禽有限公司', '上海市徐汇区上海市徐汇区H88越虹广场B座5E', '北京市海淀区杰睿大厦', '新疆乌鲁木齐市新疆省乌鲁木齐头屯河区火车西站6街']

for item in pro_json:
    print(f"{item}:")
    for i in range(len(province)-1):
        if item in province[i]:
            print(f"{province[i]}")
